Процедура ПриЗапускеСистемы()
	СтандартныеПодсистемы.ПриЗапускеСистемы();
	Подсистемы.УправлениеДоступом.ПриЗапускеСистемы();
	Подсистемы.ОбменДанными.ПриЗапускеСистемы();
	ПараметрыСеанса.ИнициализироватьПараметры();
	РегламентныеЗадания.ОбновитьРасписание();
КонецПроцедуры
Процедура ПриЗавершенииРаботыСистемы()
	СтандартныеПодсистемы.ПриЗавершенииРаботыСистемы();
	ЗаписьЖурналаРегистрации("Информация", "Система", , "Завершение работы системы");
КонецПроцедуры
Процедура ПриПередВыгрузкойДанных()
	ОбновитьДанныеДляОбмена();
	Подсистемы.ОбменДанными.ПодготовитьДанныеКВыгрузке();
КонецПроцедуры
