Функция РассчитатьРабочиеДни(ДатаНачала, ДатаОкончания) Экспорт
	График = КалендарныеГрафики.ОсновнойГрафикРаботы;
	РабочиеДни = 0;
	ТекущаяДата = ДатаНачала;
	Пока ТекущаяДата <= ДатаОкончания Цикл
		ВидДня = График.ВидДня(ТекущаяДата);
		Если ВидДня = ВидыДнейКалендаря.Рабочий Или ВидДня = ВидыДнейКалендаря.Предпраздничный Тогда
			РабочиеДни = РабочиеДни + 1;
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
	Возврат РабочиеДни;
КонецФункции
Функция РассчитатьДатуОкончанияПоСрокам(ДатаНачала, ДлительностьДней) Экспорт
	График = КалендарныеГрафики.ОсновнойГрафикРаботы;
	ТекущаяДата = ДатаНачала;
	РабочиеДни = 0;
	Пока РабочиеДни < ДлительностьДней Цикл
		ВидДня = График.ВидДня(ТекущаяДата);
		Если ВидДня = ВидыДнейКалендаря.Рабочий Или ВидДня = ВидыДнейКалендаря.Предпраздничный Тогда
			РабочиеДни = РабочиеДни + 1;
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;
	Возврат ТекущаяДата;
КонецФункции
