Функция СериализоватьОбъект(Объект) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	СтрокаXML = "";
	ЗаписьXML.УстановитьСтроку(СтрокаXML);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	СериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Попытка
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект);
	Исключение
		Возврат "";
	КонецПопытки;
	ЗаписьXML.Закрыть();
	Возврат СтрокаXML;
КонецФункции
Процедура ЗаписатьНастройкиВФайл(ИмяФайла, Настройки) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьФайл(ИмяФайла);
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	Для Каждого КлючЗначение Из Настройки Цикл
		ЗаписьJSON.ЗаписатьИмяСвойства(КлючЗначение.Ключ);
		ЗаписьJSON.ЗаписатьЗначение(КлючЗначение.Значение);
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	ЗаписьJSON.Закрыть();
КонецПроцедуры
Функция ПрочитатьНастройкиИзФайла(ИмяФайла)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	Результат = Новый Структура;
	ЧтениеJSON.Прочитать();
	Пока ЧтениеJSON.ТипТекущегоЗначения() <> ТипЗначенияJSON.КонецОбъекта Цикл
		Ключ = ЧтениеJSON.ПрочитатьИмяСвойства();
		Значение = ЧтениеJSON.ПрочитатьЗначение();
		Результат.Вставить(Ключ, Значение);
	КонецЦикла;
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции
