Процедура БезопасноеВыполнение(Действие, ОбработчикОшибки)
	Попытка
		Действие();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Если ОбработчикОшибки <> Неопределено Тогда
			ОбработчикОшибки(ТекстОшибки);
		КонецЕсли;
		ЗаписьЖурналаРегистрации("Ошибка", "БезопасноеВыполнение", , ТекстОшибки);
	КонецПопытки;
КонецПроцедуры
Функция ПопробоватьПолучитьЗначение(Объект, ИмяСвойства, ЗначениеПоУмолчанию) Экспорт
	Попытка
		Значение = Объект[ИмяСвойства];
		Если Значение = Неопределено Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		Возврат Значение;
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
КонецФункции
