Функция СохранитьЗначениеВХранилище(Ключ, Значение) Экспорт
	Хранилище = Новый ХранилищеОбщихНастроек;
	Попытка
		Хранилище.Сохранить(Ключ, Значение);
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка", "Настройки", , "Не удалось сохранить настройку " + Ключ);
		Возврат Ложь;
	КонецПопытки;
КонецФункции
Функция ЗагрузитьЗначениеИзХранилища(Ключ, ЗначениеПоУмолчанию) Экспорт
	Хранилище = Новый ХранилищеОбщихНастроек;
	Значение = Хранилище.Загрузить(Ключ);
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат Значение;
КонецФункции
