Процедура УстановитьХарактеристики(Номенклатура, ЗначенияХарактеристик)
	Если ЗначенияХарактеистик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого КлючЗначение Из ЗначенияХарактеристик Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
		СтруктураПараметров.Вставить("Свойство", ИмяСвойства);
		СтруктураПараметров.Вставить("Значение", Значение);
		УстановитьЗначениеСвойства(СтруктураПараметров);
	КонецЦикла;
КонецПроцедуры
Функция ПолучитьХарактеристику(Номенклатура, ИмяСвойства) Экспорт
	Возврат ПолучитьЗначениеСвойства(Номенклатура, ИмяСвойства);
КонецФункции
