#Если Сервер Тогда
#Область СерверныеМетоды
Процедура СервернаяПроцедура()
	Сообщить("На сервере");
КонецПроцедуры
Функция СервернаяФункция() Экспорт
	Возврат "Сервер";
КонецФункции
#КонецОбласти
#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда
Процедура КлиентскаяПроцедура()
	Сообщить("На клиенте");
КонецПроцедуры
#Иначе
#Область ОбработчикиСобытий
Процедура ОбработчикВнешнегоСобытия(Источник, Событие, Данные)
	Если Событие = "OpenHelp" Тогда
		ОткрытьСправку(Данные);
	КонецЕсли;
КонецПроцедуры
Процедура ОбработчикОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДанные" Тогда
		ОбновитьДанныеФормы();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
