// Модуль с препроцессорными директивами, регионами, переходами
#Если Сервер Или ВнешнееСоединение Тогда

Процедура ОбработчикНаСервере()

	#Область ИнициализацияРеквизитов
	Константа1 = ЗначениеНаСервере();

	Если Константа1 > 0 Тогда
		Перейти ~МеткаОбработка;
	КонецЕсли;

	Константа2 = ДополнительноеЗначение();
	~МеткаОбработка:
	Константа3 = Константа1 + Константа2;

	#КонецОбласти

КонецПроцедуры

#ИначеЕсли Клиент Тогда

Процедура ОбработчикНаКлиенте()

	// Предупреждение с паузой
	ПоказатьПредупреждение(,"Сообщение пользователю");
	Ответ = Вопрос("Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#Иначе

Процедура ОбработчикПоУмолчанию()

	Выполнить("Сообщить(""Тест"")");

КонецПроцедуры

#КонецЕсли
