Процедура ОбработатьПроведение(Отказ, РежимПроведения)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Объект.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		Движение.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
КонецПроцедуры
Процедура ОбработатьУдалениеПроведения(Отказ)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
КонецПроцедуры
Функция ТекстЗапросаДвижений(ВидДвижения) Экспорт
	Возврат "ВЫБРАТЬ * ИЗ РегистрНакопления.ОстаткиТоваров ГДЕ ВидДвижения = &Вид";
КонецФункции
