Функция СтрокаВШестнадцатеричный(Строка) Экспорт
	Результат = "";
	Для Счетчик = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Счетчик, 1);
		КодСимвола = КодСимвола(Символ);
		Шестнадцать = Цел(КодСимвола / 16);
		Остаток = КодСимвола % 16;
		Результат = Результат + Сред("0123456789ABCDEF", Шестнадцать + 1, 1);
		Результат = Результат + Сред("0123456789ABCDEF", Остаток + 1, 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция ОбратитьСтроку(Строка) Экспорт
	Результат = "";
	Длина = СтрДлина(Строка);
	Для Счетчик = 1 По Длина Цикл
		Результат = Сред(Строка, Длина - Счетчик + 1, 1) + Результат;
	КонецЦикла;
	Возврат Результат;
КонецФункции
