Процедура ПриОтправкеДанных(ОтправкаДанных, ПараметрыОтправки) Экспорт
	Если ПараметрыОтправки.Узел.Код = "000000001" Тогда
		ОтправкаДанных.Отправлять = Истина;
		ОтправкаДанных.ЭлементыДанных.Добавить("Справочник.Номенклатура");
		ОтправкаДанных.ЭлементыДанных.Добавить("Справочник.Контрагенты");
	Иначе
		ОтправкаДанных.Отправлять = Ложь;
	КонецЕсли;
КонецПроцедуры
Процедура ПриПолученииДанных(ПолучениеДанных, ПараметрыПолучения) Экспорт
	Если ПолучениеДанных.УзелОбмена <> Неопределено Тогда
		Сообщить("Получены данные от узла: " + ПолучениеДанных.УзелОбмена.Наименование);
	КонецЕсли;
КонецПроцедуры
