Процедура ЗагрузитьКурсыВалют(ДатаКурса) Экспорт
	Если ДатаКурса = Неопределено Тогда
		ДатаКурса = ТекущаяДата();
	КонецЕсли;
	ЗагрузкаКурсов = Новый ЗагрузкаКурсовВалют;
	Попытка
		ТаблицаКурсов = ЗагрузкаКурсов.Загрузить(ДатаКурса);
		Для Каждого СтрокаКурса Из ТаблицаКурсов Цикл
			Курс = Константы.КурсыВалют.ПолучитьКурс(СтрокаКурса.Валюта, ДатаКурса);
			Если Курс = Неопределено Тогда
				Запись = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
				Запись.Валюта = СтрокаКурса.Валюта;
				Запись.Период = ДатаКурса;
				Запись.Курс = СтрокаКурса.Курс;
				Запись.Кратность = СтрокаКурса.Кратность;
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка", "КурсыВалют", , ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
