Функция СоздатьОбъект(ТипОбъекта) Экспорт
	Возврат Новый (ТипОбъекта);
КонецФункции
Процедура ЗаполнитьСвойстваИзСоответствия(Объект, Соответствие)
	Для Каждого КлючЗначение Из Соответствие Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		Объект[ИмяСвойства] = Значение;
	КонецЦикла;
КонецПроцедуры
Функция ОбъектВСоответствие(Объект, СписокСвойств) Экспорт
	Результат = Новый Соответствие;
	Для Каждого ИмяСвойства Из СписокСвойств Цикл
		Результат.Вставить(ИмяСвойства, Объект[ИмяСвойства]);
	КонецЦикла;
	Возврат Результат;
КонецФункции
