Функция ВыполнитьHTTPЗапрос(URL, Метод, Данные) Экспорт
	HTTPСоединение = Новый HTTPСоединение(URL);
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.Метод = Метод;
	Если Данные <> Неопределено Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;
	Попытка
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
		Иначе
			ВызватьИсключение "HTTP ошибка: " + HTTPОтвет.КодСостояния;
		КонецЕсли;
	Исключение
		ВызватьИсключение "Ошибка HTTP запроса: " + ОписаниеОшибки();
	КонецПопытки;
КонецФункции
