Функция НС(СтрокаНаРусском, СтрокаНаАнглийском) Экспорт
	Язык = ТекущийЯзык();
	Если Язык.КодЯзыка = "en" Тогда
		Возврат СтрокаНаАнглийском;
	КонецЕсли;
	Возврат СтрокаНаРусском;
КонецФункции
Функция ФорматироватьЧислоСУчетомЛокали(Число) Экспорт
	Язык = ТекущийЯзык();
	Если Язык.КодЯзыка = "en" Тогда
		Формат = "ЧРД=.; ЧГ=3";
	Иначе
		Формат = "ЧРД=,; ЧГ=3";
	КонецЕсли;
	Возврат Формат(Число, Формат);
КонецФункции
Процедура ОбновитьЗаголовкиФормы(Форма)
	ЯзыкПользователя = ТекущийЯзык();
	Если ЯзыкПользователя.КодЯзыка = "en" Тогда
		Форма.Заголовок = "Product List";
	ИначеЕсли ЯзыкПользователя.КодЯзыка = "de" Тогда
		Форма.Заголовок = "Produktliste";
	Иначе
		Форма.Заголовок = "Список товаров";
	КонецЕсли;
КонецПроцедуры
