Процедура НастроитьОтборСКД(Схема, СтруктураОтборов)
	Для Каждого ЭлементОтбора Из СтруктураОтборов Цикл
		ИмяПоля = ЭлементОтбора.Ключ;
		ЗначениеОтбора = ЭлементОтбора.Значение;
		ПолеОтбора = Схема.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ПолеОтбора.ПравоеЗначение = ЗначениеОтбора;
		ПолеОтбора.Использование = Истина;
	КонецЦикла;
КонецПроцедуры
Процедура НастроитьПорядокСКД(Схема, ПолеСортировки, Направление)
	ЭлементПорядка = Схема.НастройкиПоУмолчанию.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ПолеСортировки);
	Если Направление = "Убыв" Тогда
		ЭлементПорядка.Направление = НаправлениеСортировкиКомпоновкиДанных.Убывание;
	Иначе
		ЭлементПорядка.Направление = НаправлениеСортировкиКомпоновкиДанных.Возрастание;
	КонецЕсли;
КонецПроцедуры
