Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Сообщить("Не заполнено наименование");
		Отказ = Истина;
	КонецЕсли;
	Если Объект.Родитель = Объект.Ссылка Тогда
		Сообщить("Родителем указан текущий элемент");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	Объект.ПометкаУдаления = Ложь;
	Если ПустаяСтрока(Объект.Код) Тогда
		Объект.Код = КодыОбъектов.ПолучитьКод(Объект.Метаданные().ПолноеИмя());
	КонецЕсли;
КонецПроцедуры
Процедура ПриКопировании(ЭлементИсточник)
	Объект.Наименование = ЭлементИсточник.Наименование + " (копия)";
	Объект.Код = "";
КонецПроцедуры
Процедура ОбработкаУдаления(Отказ)
	Если Не ПустаяСтрока(Объект.Наименование) Тогда
		ЗаписьЖурналаРегистрации("Удаление", "Справочник", Объект.Ссылка, "Удален элемент: " + Объект.Наименование);
	КонецЕсли;
КонецПроцедуры
