Процедура ВыгрузитьКонфигурацию(ИмяФайла) Экспорт
	Конфигурация = Метаданные.ОсновнаяКонфигурация;
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Configuration");
	ЗаписьXML.ЗаписатьАтрибут("version", Конфигурация.Версия);
	Для Каждого Объект Из Конфигурация.Справочники Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Catalog");
		ЗаписьXML.ЗаписатьАтрибут("name", Объект.Имя);
		ЗаписьXML.ЗаписатьАтрибут("synonym", Объект.Синоним);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
КонецПроцедуры
Функция СравнитьВерсииКонфигураций(Версия1, Версия2) Экспорт
	МассивВерсии1 = СтрРазделить(Версия1, ".");
	МассивВерсии2 = СтрРазделить(Версия2, ".");
	Для Счетчик = 0 По МассивВерсии1.Количество() - 1 Цикл
		Если Счетчик >= МассивВерсии2.Количество() Тогда
			Возврат 1;
		КонецЕсли;
		ЧислоВерсии1 = Число(МассивВерсии1[Счетчик]);
		ЧислоВерсии2 = Число(МассивВерсии2[Счетчик]);
		Если ЧислоВерсии1 > ЧислоВерсии2 Тогда
			Возврат 1;
		ИначеЕсли ЧислоВерсии1 < ЧислоВерсии2 Тогда
			Возврат -1;
		КонецЕсли;
	КонецЦикла;
	Возврат 0;
КонецФункции
