Процедура ВыгрузитьВExcel(Таблица, ИмяФайла) Экспорт
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Книга = Excel.WorkBooks.Add();
		Лист = Книга.WorkSheets(1);
		Для СчетчикКолонки = 1 По Таблица.Колонки.Количество() Цикл
			Ячейка = Лист.Cells(1, СчетчикКолонки);
			Ячейка.Value = Таблица.Колонки[СчетчикКолонки - 1].Имя;
		КонецЦикла;
		СчетчикСтроки = 2;
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Для СчетчикКолонки = 1 По Таблица.Колонки.Количество() Цикл
				Лист.Cells(СчетчикСтроки, СчетчикКолонки).Value = СтрокаТаблицы[СчетчикКолонки - 1];
			КонецЦикла;
			СчетчикСтроки = СчетчикСтроки + 1;
		КонецЦикла;
		Книга.SaveAs(ИмяФайла);
		Excel.Quit();
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка", "Excel", , "Ошибка выгрузки в Excel: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
