Функция ЗначениеВСтроку(Значение) Экспорт
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Строка") Тогда
		Возврат "'" + Значение + "'";
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Строка(Значение);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=yyyy-MM-dd HH:mm:ss");
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат ?(Значение, "Истина", "Ложь");
	Иначе
		Возврат ЗначениеВСтрокуВнутр(Значение);
	КонецЕсли;
КонецФункции
Функция СкопироватьРекурсивно(Значение) Экспорт
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Структура") Тогда
		Копия = Новый Структура;
		Для Каждого КлючЗначение Из Значение Цикл
			Копия.Вставить(КлючЗначение.Ключ, СкопироватьРекурсивно(КлючЗначение.Значение));
		КонецЦикла;
		Возврат Копия;
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		Копия = Новый Массив;
		Для Каждого Элемент Из Значение Цикл
			Копия.Добавить(СкопироватьРекурсивно(Элемент));
		КонецЦикла;
		Возврат Копия;
	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда
		Копия = Новый Соответствие;
		Для Каждого КлючЗначение Из Значение Цикл
			Копия.Вставить(КлючЗначение.Ключ, СкопироватьРекурсивно(КлючЗначение.Значение));
		КонецЦикла;
		Возврат Копия;
	КонецЕсли;
	Возврат Значение;
КонецФункции
