Процедура УстановитьПараметрыСеанса()
	ПараметрыСеанса.ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПараметрыСеанса.ТекущаяДата = ТекущаяДатаСеанса();
	ПараметрыСеанса.ИспользоватьВалютныйУчет = Константы.ИспользоватьВалютныйУчет.Получить();
	Если ПараметрыСеанса.ТекущийПользователь <> Неопределено Тогда
		ПараметрыСеанса.ОсновнаяВалюта = ПараметрыСеанса.ТекущийПользователь.ОсновнаяВалюта;
		ПараметрыСеанса.ОсновнойСклад = ПараметрыСеанса.ТекущийПользователь.ОсновнойСклад;
	КонецЕсли;
КонецПроцедуры
Процедура ПриНачалеРаботыСистемы()
	УстановитьПараметрыСеанса();
	СтандартныеПодсистемы.ПриНачалеРаботыСистемы();
КонецПроцедуры
