Функция ПолучитьСтатусЗаказаПоИмени(ИмяСтатуса) Экспорт
	Если ИмяСтатуса = "Новый" Тогда
		Возврат Перечисления.СтатусыЗаказов.Новый;
	ИначеЕсли ИмяСтатуса = "ВРаботе" Тогда
		Возврат Перечисления.СтатусыЗаказов.ВРаботе;
	ИначеЕсли ИмяСтатуса = "Выполнен" Тогда
		Возврат Перечисления.СтатусыЗаказов.Выполнен;
	ИначеЕсли ИмяСтатуса = "Отменен" Тогда
		Возврат Перечисления.СтатусыЗаказов.Отменен;
	КонецЕсли;
	Возврат Перечисления.СтатусыЗаказов.ПустаяСсылка;
КонецФункции
Функция СтатусДопускаетИзменение(Статус) Экспорт
	Возврат Не (Статус = Перечисления.СтатусыЗаказов.Выполнен Или Статус = Перечисления.СтатусыЗаказов.Отменен);
КонецФункции
