Функция ПодписатьДанные(Данные, Сертификат) Экспорт
	Криптография = Новый Криптография;
	Подпись = Криптография.Подписать(Данные, Сертификат);
	Возврат Подпись;
КонецФункции
Функция ПроверитьПодпись(Данные, Подпись, Сертификат) Экспорт
	Криптография = Новый Криптография;
	Возврат Криптография.ПроверитьПодпись(Данные, Подпись, Сертификат);
КонецФункции
Функция ЗашифроватьДанные(Данные, Сертификат) Экспорт
	Криптография = Новый Криптография;
	ЗашифрованныеДанные = Криптография.Зашифровать(Данные, Сертификат);
	Возврат ЗашифрованныеДанные;
КонецФункции
Функция РасшифроватьДанные(ЗашифрованныеДанные, ЗакрытыйКлюч, Пароль) Экспорт
	Криптография = Новый Криптография;
	Возврат Криптография.Расшифровать(ЗашифрованныеДанные, ЗакрытыйКлюч, Пароль);
КонецФункции
